Emacs/demacs.org
#+TITLE: DEmacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle  ~/.dotfiles/Emacs/emacs-configs/demacs/init.el :mkdirp yes
* Some improve in early-init
#+begin_src emacs-lisp :tangle ~/.dotfiles/Emacs/emacs-configs/demacs/early-init.el
(setq gc-cons-threshold most-positive-fixnum)

(setq load-prefer-newer noninteractive)
#+end_src
* Native Compilation
 #+begin_src emacs-lisp
   (setq comp-async-jobs-number 7 
	 comp-deferred-compilation t
	 comp-async-report-warnings-errors nil)
  (add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))
 #+end_src
* Package Management
** Straight.el
#+begin_src emacs-lisp
(setq comp-deferred-compilation-deny-list ())
(setq straight-vc-git-default-clone-depth 1)

(setq straight-disable-native-compile
      (when (fboundp 'native-comp-available-p)
	(not (native-comp-available-p))))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Always use straight to install on systems other than Linux
(setq straight-use-package-by-default t)

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)
(setq use-package-verbose t)

(if (daemonp)
    (setq use-package-always-demand t))

;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)


(setq package-enable-at-startup nil)
#+end_src
* Graphic Only Plugins Setting
#+begin_src emacs-lisp
(setq graphic-only-plugins-setting ())
#+end_src
* Pathes
** Exact Path on MacOs
 The package is help emacs to find exact path in the shell
#+begin_src emacs-lisp
;; Find Executable Path on OS X
;; (push '
 (use-package exec-path-from-shell
	 :init
	 (when (memq window-system '(mac ns))
	   (exec-path-from-shell-initialize))
	  )
;;graphic-only-plugins-setting)
 #+end_src
** Update Load Path
#+begin_src emacs-lisp
;; Add my library path to load-path
(push "~/.dotfiles/Emacs/emacs-configs/demacs/lisp" load-path)

(push "~/Documents/Org" load-path)
#+end_src
* Auto Doing something
** Stop Backup and "Auto-Save"
 Stop backup and auto-save (save as a backup) made by emacs
 #+begin_src emacs-lisp
 ;; 关闭备份
 (setq make-backup-files nil
       auto-save-default nil)
 #+end_src
** Stop Auto-Change Vertical Scroll Size
 #+begin_src emacs-lisp
 (setq auto-window-vscroll nil)
 #+end_src
** Auto-Reverting Changed Files
 auto allow the outside changes
 #+begin_src emacs-lisp
 (global-auto-revert-mode 1)
 #+end_src
** Auto-Tangle emacs.org File
 Tangle (form a new file) on save
 #+begin_src emacs-lisp
 ;; Since we don't want to disable org-confirm-babel-evaluate all
 ;; of the time, do it around the after-save-hook
 (defun dw/org-babel-tangle-dont-ask ()
   ;; Dynamic scoping to the rescue
   (let ((org-confirm-babel-evaluate nil))
     (org-babel-tangle)))

 (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'dw/org-babel-tangle-dont-ask
                                               'run-at-end 'only-in-org-mode)))
 #+end_src
** Auto-Saving Changed Files
The package make emacs auto save the files
 #+begin_src emacs-lisp
 (use-package super-save
   :diminish super-save-mode
   :custom
   (super-save-auto-save-when-idle t)
   :config
   (super-save-mode +1))
 #+end_src
** Midnight-Mode
#+begin_src emacs-lisp
(use-package midnight
  :if (daemonp)
  :config
  (midnight-mode t)
  (setq midnight-period 7200)
  )
#+end_src
* UI Setup
** Hide Useless UI
 #+begin_src emacs-lisp :tangle ~/.dotfiles/Emacs/emacs-configs/demacs/early-init.el
 (setq inhibit-startup-message t)

 (scroll-bar-mode -1)        ; Disable visible scrollbar
 (tool-bar-mode -1)          ; Disable the toolbar
 (tooltip-mode -1)           ; Disable tooltips
 (set-fringe-mode 10)

 (menu-bar-mode -1)          ; Disable the menu bar


 (setq ring-bell-function 'ignore)
 #+end_src
** Frame Transparency and Maximize Windows
 #+begin_src emacs-lisp :tangle ~/.dotfiles/Emacs/emacs-configs/demacs/early-init.el
 (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
 (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
 (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
 (add-to-list 'default-frame-alist '(fullscreen . maximized))
 #+end_src
** Line Number
 #+begin_src emacs-lisp
 ;; Enalbe column number
 (column-number-mode)

 ;; Enable liner number
 (global-display-line-numbers-mode t)

 ;; Disable line numbers for some modes
 (dolist (mode '(org-mode-hook
                 term-mode-hook
                 vterm-mode-hook
                 shell-mode-hook
                 eshell-mode-hook))
   (add-hook mode (lambda () (display-line-numbers-mode 0))))
 #+end_src
** Fonts
 #+begin_src emacs-lisp
 (defun dw/set-font-faces ()
   (message "Setting faces!")
   ;; set font
   (set-face-attribute 'default nil :font "Victor Mono" :height 150)

   ;; Set the fixed pitch face
   (set-face-attribute 'fixed-pitch nil :font "Victor Mono" :height 150)

   ;; Set the variable pitch face
   (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 150 :weight 'regular))
 #+end_src
** Fonts Ligature
#+begin_src emacs-lisp
(push '(use-package ligature
	 :straight (ligature.el :type git :host github :repo "mickeynp/ligature.el")
	 :config
	 ;; Enable the "www" ligature in every possible major mode
	 (ligature-set-ligatures 't '("www"))
	 ;; Enable traditional ligature support in eww-mode, if the
	 ;; `variable-pitch' face supports it
	 (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
	 ;; Enable all Cascadia Code ligatures in programming modes
	 (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
					      ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
					      "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
					      "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
					      "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
					      "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
					      "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
					      "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
					      ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
					      "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
					      "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
					      "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
					      "\\\\" "://"))
	 ;; Enables ligature checks globally in all buffers. You can also do it
	 ;; per mode with `ligature-mode'.
	 (global-ligature-mode t)) graphic-only-plugins-setting)
#+end_src
** Icons Support 
 #+begin_src emacs-lisp
 (push '(use-package all-the-icons
    :custom
    (all-the-icons-dired-monochrome t)) graphic-only-plugins-setting)
 #+end_src
** Themes
 #+begin_src emacs-lisp
  (use-package doom-themes)
 #+end_src
** Change Theme Based On System Appearance
#+begin_src emacs-lisp
(if (not (display-graphic-p))
    (load-theme 'doom-one t))

(if (display-graphic-p)
    (defun dw/apply-theme (appearance)
      "Load theme, taking current system APPEARANCE into consideration."
      (mapc #'disable-theme custom-enabled-themes)
      (pcase appearance
	('light (load-theme 'doom-solarized-light t))
	('dark (load-theme 'doom-one t))))
  )
#+end_src
** Modeline 
 #+begin_src emacs-lisp
 (use-package doom-modeline
   :init (doom-modeline-mode 1)
   :custom
   (doom-modeline-window-width-limit fill-column)
   (doom-modeline-icon (display-graphic-p))
   )
 #+end_src
** Dashbard
 #+begin_src emacs-lisp
 (use-package dashboard
   :init
   ;; Set the title
   ;; Set the banner
   (setq dashboard-startup-banner "~/.dotfiles/Emacs/dashboard/banner.txt")
   (setq dashboard-center-content t)
   :config
   (dashboard-setup-startup-hook)
   (setq dashboard-items '((recents  . 7)
                           (projects . 5)
                           ))
   (setq dashboard-set-heading-icons t)
   (setq dashboard-set-file-icons t)
   (setq dashboard-set-init-info t)
   )
 #+end_src
** Nyan Mode
#+begin_src emacs-lisp
(push '(use-package nyan-mode
	 :custom
	 (nyan-mode t)
	 (nyan-animate-nyancat t)
	 (nyan-wavy-trail t)
	 ) graphic-only-plugins-setting)
#+end_src
** Highlight TODOs
#+begin_src emacs-lisp
(use-package hl-todo
  :hook ((org-mode lsp-mode) . hl-todo-mode)
  :config
  (setq hl-todo-keyword-faces
      '(("TODO"   . "#FF0000")
        ("FIXME"  . "#FF0000")
        ("DEBUG"  . "#A020F0")
        ("NEXT" . "#FF4500")
        ("UNCHECK"   . "#1E90FF")))
  )
#+end_src
