Emacs/emacs-configs/demacs/init.el
(setq comp-async-jobs-number 7 
       comp-deferred-compilation t
       comp-async-report-warnings-errors nil)
(add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))

(setq comp-deferred-compilation-deny-list ())
(setq straight-vc-git-default-clone-depth 1)

(setq straight-disable-native-compile
      (when (fboundp 'native-comp-available-p)
	(not (native-comp-available-p))))

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Always use straight to install on systems other than Linux
(setq straight-use-package-by-default t)

;; Use straight.el for use-package expressions
(straight-use-package 'use-package)
(setq use-package-verbose t)

(if (daemonp)
    (setq use-package-always-demand t))

;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)


(setq package-enable-at-startup nil)

(setq graphic-only-plugins-setting ())

;; Find Executable Path on OS X
;; (push '
 (use-package exec-path-from-shell
	 :init
	 (when (memq window-system '(mac ns))
	   (exec-path-from-shell-initialize))
	  )
;;graphic-only-plugins-setting)

;; Add my library path to load-path
(push "~/.dotfiles/Emacs/emacs-configs/demacs/lisp" load-path)

(push "~/Documents/Org" load-path)

;; 关闭备份
(setq make-backup-files nil
      auto-save-default nil)

(setq auto-window-vscroll nil)

(global-auto-revert-mode 1)

;; Since we don't want to disable org-confirm-babel-evaluate all
;; of the time, do it around the after-save-hook
(defun dw/org-babel-tangle-dont-ask ()
  ;; Dynamic scoping to the rescue
  (let ((org-confirm-babel-evaluate nil))
    (org-babel-tangle)))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'dw/org-babel-tangle-dont-ask
                                              'run-at-end 'only-in-org-mode)))

(use-package super-save
  :diminish super-save-mode
  :custom
  (super-save-auto-save-when-idle t)
  :config
  (super-save-mode +1))

(use-package midnight
  :if (daemonp)
  :config
  (midnight-mode t)
  (setq midnight-period 7200)
  )

;; Enalbe column number
(column-number-mode)

;; Enable liner number
(global-display-line-numbers-mode t)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                vterm-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(defun dw/set-font-faces ()
  (message "Setting faces!")
  ;; set font
  (set-face-attribute 'default nil :font "Victor Mono" :height 150)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "Victor Mono" :height 150)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 150 :weight 'regular))

(push '(use-package ligature
	 :straight (ligature.el :type git :host github :repo "mickeynp/ligature.el")
	 :config
	 ;; Enable the "www" ligature in every possible major mode
	 (ligature-set-ligatures 't '("www"))
	 ;; Enable traditional ligature support in eww-mode, if the
	 ;; `variable-pitch' face supports it
	 (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
	 ;; Enable all Cascadia Code ligatures in programming modes
	 (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
					      ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
					      "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
					      "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
					      "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
					      "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
					      "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
					      "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
					      ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
					      "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
					      "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
					      "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
					      "\\\\" "://"))
	 ;; Enables ligature checks globally in all buffers. You can also do it
	 ;; per mode with `ligature-mode'.
	 (global-ligature-mode t)) graphic-only-plugins-setting)

(push '(use-package all-the-icons
   :custom
   (all-the-icons-dired-monochrome t)) graphic-only-plugins-setting)

(use-package doom-themes)

(if (not (display-graphic-p))
    (load-theme 'doom-one t))

(if (display-graphic-p)
    (defun dw/apply-theme (appearance)
      "Load theme, taking current system APPEARANCE into consideration."
      (mapc #'disable-theme custom-enabled-themes)
      (pcase appearance
	('light (load-theme 'doom-solarized-light t))
	('dark (load-theme 'doom-one t))))
  )

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom
  (doom-modeline-window-width-limit fill-column)
  (doom-modeline-icon (display-graphic-p))
  )

(use-package dashboard
  :init
  ;; Set the title
  ;; Set the banner
  (setq dashboard-startup-banner "~/.dotfiles/Emacs/dashboard/banner.txt")
  (setq dashboard-center-content t)
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-items '((recents  . 7)
                          (projects . 5)
                          ))
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-set-init-info t)
  )

(push '(use-package nyan-mode
	 :custom
	 (nyan-mode t)
	 (nyan-animate-nyancat t)
	 (nyan-wavy-trail t)
	 ) graphic-only-plugins-setting)

(use-package hl-todo
  :hook ((org-mode lsp-mode) . hl-todo-mode)
  :config
  (setq hl-todo-keyword-faces
      '(("TODO"   . "#FF0000")
        ("FIXME"  . "#FF0000")
        ("DEBUG"  . "#A020F0")
        ("NEXT" . "#FF4500")
        ("UNCHECK"   . "#1E90FF")))
  )
