Emacs/demacs.org
** Highligh Numbers
#+begin_src emacs-lisp
(use-package highlight-numbers
  :hook ((org-mode lsp-mode) . highlight-numbers-mode))
#+end_src
** UI in Deamon
#+begin_src emacs-lisp
(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (setq doom-modeline-icon t)
		(add-hook 'ns-system-appearance-change-functions #'dw/apply-theme)
		(dashboard-setup-startup-hook)
                (with-selected-frame frame
                  (dw/set-font-faces))
		(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
		))
  (add-hook 'ns-system-appearance-change-functions #'dw/apply-theme)
  (if (display-graphic-p)
      (dw/set-font-faces)
    )
  )
#+end_src
* Buffer Management
** Perspective.el
#+begin_src emacs-lisp
(if (or (not (daemonp)) (string= (daemonp) "main"))
    (use-package perspective
      :demand t
      :bind (("C-M-k" . persp-switch)
             ("C-M-n" . persp-next)
             ("C-x k" . persp-kill-buffer*))
      :custom
      (persp-initial-frame-name "Main")
      :config
      ;; Running `persp-mode' multiple times resets the perspective list...
      (unless (equal persp-mode t)
	(persp-mode)))
  )
#+end_src
* Window Management
** Ace Window
   Use =C-x o= to active =ace-window= to swap the windows (less than two windows), or using following arguments (more than two):
- =x= - delete window
- =m= - swap windows
- =M= - move window
- =c= - copy window
- =j= - select buffer
- =n= - select the previous window
- =u= - select buffer in the other window
- =c= - split window fairly, either vertically or horizontally
- =v= - split window vertically
- =b= - split window horizontally
- =o= - maximize current window
- =?= - show these command bindings
#+begin_src emacs-lisp
(use-package ace-window
  :bind ("C-x o" . ace-window)
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src
** Edwina
#+begin_src emacs-lisp
(use-package edwina
  :disabled
  :config
  (setq display-buffer-base-action '(display-buffer-below-selected))
  (edwina-mode 1))
#+end_src
* File Management
** Dired
 #+begin_src emacs-lisp
 (use-package dired
    :straight nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    )
 
 (use-package dired-single
   :commands (dired dired-jump))
 
 (push '(use-package all-the-icons-dired
          :hook (dired-mode . all-the-icons-dired-mode)) graphic-only-plugins-setting)
 
 (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    )
 
 (use-package diredfl
    :hook (dired-mode . diredfl-mode)
    )
 #+end_src
* Keybinding Management
** Keybinding Panel (which-key)
 #+begin_src emacs-lisp
 (use-package which-key
   :init (which-key-mode)
   :diminish which-key-mode
   :config
   (setq which-key-idle-delay 0.3))
 #+end_src
 * Project Management
* Project Managemennt
** Projectile
 #+begin_src emacs-lisp
 (use-package projectile
   :diminish projectile-mode
   :config (projectile-mode)
   :bind-keymap
   ("C-c p" . projectile-command-map)
   :init
   (when (file-directory-p "~/Documents/Projects/Code")
     (setq projectile-project-search-path '("~/Documents/Projects/Code")))
   (setq projectile-switch-project-action #'projectile-dired))
 #+end_src
* Completion System
** Completions with Vertico
#+begin_src emacs-lisp
(defun dw/minibuffer-backward-kill (arg)
  "When minibuffer is completing a file name delete up to parent
folder, otherwise delete a word"
  (interactive "p")
  (if minibuffer-completing-file-name
      ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
      (if (string-match-p "/." (minibuffer-contents))
          (zap-up-to-char (- arg) ?/)
        (delete-minibuffer-contents))
      (backward-kill-word arg)))

(use-package vertico
  :bind (:map vertico-map
         ("C-j" . vertico-next)
         ("C-k" . vertico-previous)
         ("C-f" . vertico-exit)
         :map minibuffer-local-map
         ("M-h" . dw/minibuffer-backward-kill))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))
#+end_src
** Preserve Minibuffer History with savehist-mode
#+begin_src emacs-lisp
(use-package savehist
  :config
  (setq history-length 25)
  (savehist-mode 1))
#+end_src
** Improved Candidate Filtering with Orderless
#+begin_src emacs-lisp
(use-package orderless
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src
** Completion Annotations with Marginalia
#+begin_src emacs-lisp
(use-package marginalia
  :after vertico
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))
#+end_src
** Completions in Regions with Corfu
#+begin_src emacs-lisp
(use-package corfu
  :straight '(corfu :host github
                    :repo "minad/corfu")
  :bind (:map corfu-map
         ("C-j" . corfu-next)
         ("C-k" . corfu-previous)
         ("C-f" . corfu-insert))
  :custom
  (corfu-cycle t)
  :config
  (corfu-global-mode))
#+end_src
** Consult Commands
#+begin_src emacs-lisp
(defun dw/get-project-root ()
  (when (fboundp 'projectile-project-root)
    (projectile-project-root)))

(use-package consult
  :demand t
  :bind (("C-s" . consult-line)
         ("C-M-l" . consult-imenu)
         ("C-M-j" . persp-switch-to-buffer*)
         :map minibuffer-local-map
         ("C-r" . consult-history))
  :custom
  (consult-project-root-function #'dw/get-project-root)
  (completion-in-region-function #'consult-completion-in-region))
#+end_src
* Helpful function
** Helpful Function Description
 #+begin_src emacs-lisp
 (use-package helpful
   :commands (helpful-callable helpful-variable helpful-command helpful-key)
   :bind
   ([remap describe-function] . helpful-function)
   ([remap describe-command] . helpful-command)
   ([remap describe-variable] . helpful-variable)
   ([remap describe-key] . helpful-key))
 #+end_src

* Org Mode
** Config Basic Org mode
 #+begin_src emacs-lisp
  (defun dw/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))
  
  (use-package org
    :hook (org-mode . dw/org-mode-setup)
    :config
    (setq org-html-head-include-default-style nil)
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers nil
          org-src-fontify-natively t
          org-src-tab-acts-natively t
          org-edit-src-content-indentation 0
          org-hide-block-startup nil
          org-src-preserve-indentation nil
          org-startup-folded 'content
          org-cycle-separator-lines 2)
    
    (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
  
    (setq org-html-htmlize-output-type nil)
  
   ;; config for images in org
    (auto-image-file-mode t)
    (setq org-image-actual-width nil)
    ;; default image width
    (setq org-image-actual-width '(300))
  
    (setq org-export-with-sub-superscripts nil)
  
    ;; 不要自动创建备份文件
    (setq make-backup-files nil)
  
    (with-eval-after-load 'org-agenda
        (require 'init-org-agenda))
  
    (use-package ob-browser
      :defer t)
  
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (latex . t)
       (java . t)
       (C . t)
       (js . t)
       (browser . t)
       (python . t)))
  
    (setq org-confirm-babel-evaluate nil)
    (push '("conf-unix" . conf-unix) org-src-lang-modes)
  
    ;; Edited from http://emacs.stackexchange.com/a/9838
    (defun dw/org-html-wrap-blocks-in-code (src backend info)
      "Wrap a source block in <pre><code class=\"lang\">.</code></pre>"
      (when (org-export-derived-backend-p backend 'html)
        (replace-regexp-in-string
         "\\(</pre>\\)" "</code>\n\\1"
         (replace-regexp-in-string "<pre class=\"src src-\\([^\"]*?\\)\">"
                                "<pre>\n<code class=\"\\1\">" src))))
  
    (require 'ox-html)
  
    (add-to-list 'org-export-filter-src-block-functions
              'dw/org-html-wrap-blocks-in-code)
    )
 #+end_src
** Bullets
 #+begin_src emacs-lisp
 ;; change bullets for headings
 (use-package org-bullets
   :after org
   :hook (org-mode . org-bullets-mode)
   :custom
   (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
 #+end_src
