Emacs/emacs-configs/demacs/init.el

(use-package evil-nerd-commenter
  :commands (evilnc-comment-or-uncomment-lines)
  :bind
  ("M-;" . 'evilnc-comment-or-uncomment-lines)
  ("C-c l" . 'evilnc-quick-comment-or-uncomment-to-the-line)
  ("C-c c" . 'evilnc-copy-and-comment-lines)
  ("C-c p" . 'evilnc-comment-or-uncomment-paragraphs)
  )

(use-package company 
  :hook (lsp-mode . company-mode)
  :custom
  (company-tooltip-align-annotations t)
  ;; Number the candidates (use M-1, M-2 etc to select completions)
  (company-show-numbers t)
  ;; starts with 1 character
  (company-minimum-prefix-length 1)
  ;; Trigger completion immediately
  (company-idle-delay 0)
  ;; Back to top when reach the end
  (company-selection-wrap-around t)
  :config
  ;; Use tab key to cycle through suggestions.
  ;; ('tng' means 'tab and go')
  (company-tng-configure-default)

  )

;;Completion based on AI 
(use-package company-tabnine
  :after company
  :config
  (push '(company-capf :with company-tabnine :separate company-yasnippet :separete) company-backends))

;; Add UI for Company
(push '(use-package company-box
         :hook (company-mode . company-box-mode)
         :config
         (setq company-box-icons-alist 'company-box-icons-all-the-icons)) graphic-only-plugins-setting)

(defun dw/get-project-root ()
  (when (fboundp 'projectile-project-root)
    (projectile-project-root)))

(use-package citre
  :commands (citre-jump citre-ace-peek)
  :init
  ;; This is needed in `:init' block for lazy load to work.
  (require 'citre-config)
  ;; Bind your frequently used commands.
  :bind (("C-x c j" . 'citre-jump)
	   ("C-x c J" . 'citre-jump-back)
	   ("C-x c p" .  'citre-ace-peek))
  :custom
  ;; Set this if you use project management plugin like projectile.  It's
  ;; only used to display paths relatively, and doesn't affect actual use.
  (citre-project-root-function #'dw/get-project-root)
  (citre-use-project-root-when-creating-tags t)
  (citre-prompt-language-for-ctags-command t)
  (citre-auto-enable-citre-mode-modes '(prog-mode))
  )

(use-package smartparens
  :hook (lsp-mode . smartparens-mode))

(use-package rainbow-delimiters
  :hook (lsp-mode . rainbow-delimiters-mode))

(use-package rainbow-mode
  :hook ((org-mode lsp-mode) . rainbow-mode))

(use-package hungry-delete
  :hook (lsp-mode . hungry-delete-mode))

(use-package indent-guide
  :hook (lsp-mode. indent-guide-mode))

(use-package format-all
  :hook (lsp-mode . format-all-mode)
  :commands (format-all-ensure-formatter format-all-buffer))

(use-package quickrun
  :commands (quickrun)
  :config
  ;; set python3 as default
  (quickrun-add-command "python" 
    '((:command . "python3") 
      (:exec . "%c %s") 
      (:tempfile . nil)) 
    :default "python"))

(use-package flycheck
  :hook (lsp-mode . flycheck-mode))

(use-package yasnippet
  :hook ((org-mode lsp-mode) . yas-minor-mode)
  :config
  (setq yas-snippet-dirs
    '("~/.dotfiles/Emacs/snippets"))
  (yas-reload-all))

;; Snippets Collection
(use-package yasnippet-snippets
  :after yasnippet)

;; auto insert
(use-package auto-yasnippet
  :disabled
  :after yasnippet)

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (((sh-mode typescript-mode js2-mode web-mode css-mode Latex-mode TeX-latex-mode c-mode cc-mode) . lsp-deferred)
         (lsp-mode . lsp-enable-which-key-integration))
  :init
  (setq lsp-keymap-prefix "C-c l")
  :custom
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-signature-auto-activate nil)
  (lsp-signature-render-documentation nil)
  (lsp-log-io nil)
  (lsp-idle-delay 0.500)
  (lsp-completion-provider :capf)
  :config
  (add-to-list 'lsp-language-id-configuration '((scss-mode . "css")
                                                (less-css-mode . "css")))
  )

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-sideline-enable t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-doc-position 'bottom)
  (lsp-ui-imenu-auto-refresh t)
  )

(use-package lsp-ivy
  :disabled
  :after lsp
  :commands lsp-ivy-workspace-symbol)

(use-package lsp-treemacs
  :after lsp
  :commands lsp-treemacs-errors-list)

(use-package lsp-pyright
  :after python-mode
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp-deferred))))

(use-package pyenv-mode
  :hook (python-mode . pyenv-mode)
  )

;; auto activates the virtual environment if .python-version exists
(use-package pyenv-mode-auto
  :after pyenv-mode)

(use-package nvm
  :after (typescript-mode js2-mode))

(use-package typescript-mode
  :mode "\\.ts\\'"
  :config
  (setq typescript-indent-level 2))

(defun dw/set-js-indentation ()
  (setq js-indent-level 2)
  (setq evil-shift-width js-indent-level)
  (setq-default tab-width 2))

(use-package js2-mode
  :mode "\\.m?jsx?\\'"
	:config

	;; Don't use built-in syntax checking
	(setq js2-mode-show-strict-warnings nil)

	;; Set up proper indentation in JavaScript
	(add-hook 'js2-mode-hook #'dw/set-js-indentation)
	)

(use-package prettier-js
	:disabled
  :hook ((js2-mode . prettier-js-mode)
         (typescript-mode . prettier-js-mode))
  :config
  (setq prettier-js-show-errors nil))

(use-package coffee-mode
  :mode "\\.coffee\\'"
  :config
  ;; automatically clean up bad whitespace
  (setq whitespace-action '(auto-cleanup))
  ;; This gives you a tab of 2 spaces
  (custom-set-variables '(coffee-tab-width 2))
  
  (use-package sourcemap)
  ;; generating sourcemap by '-m' option. And you must set '--no-header' option
  (setq coffee-args-compile '("-c" "--no-header" "-m"))
  (add-hook 'coffee-after-compile-hook 'sourcemap-goto-corresponding-point)

  ;; If you want to remove sourcemap file after jumping corresponding point
  (defun my/coffee-after-compile-hook (props)
    (sourcemap-goto-corresponding-point props)
    (delete-file (plist-get props :sourcemap)))
  (add-hook 'coffee-after-compile-hook 'my/coffee-after-compile-hook)
  )

(use-package flymake-coffee
  :hook (coffee-mode . flymake-coffee)
  )

(use-package web-mode
  :mode "\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'")

;; Preview the html file
(use-package skewer-mode
  :after web-mode
  :config
  (add-hook 'js2-mode-hook 'skewer-mode)
  (add-hook 'css-mode-hook 'skewer-css-mode)
  (add-hook 'html-mode-hook 'skewer-html-mode)
  (add-hook 'web-mode-hook 'skewer-html-mode))

(use-package emmet-mode
  :hook (web-mode . emmet-mode))

(use-package scss-mode
  :mode "\\.scss\\'"
  :custom
  (scss-compile-at-save t)
  (scss-output-directory "../css")
  (scss-sass-command "sass --no-source-map")
  )

(use-package lsp-java
  :hook (java-mode . lsp-deferred)
  )

(use-package latex-preview-pane
