Emacs/demacs.org
**** latex-preview-pane
  Preview latex files as PDF in Emacs
  #+begin_src emacs-lisp
  (use-package latex-preview-pane
    :commands (latex-preview-pane-mode latex-preview-pane-update))
  #+end_src
**** AucTex
#+begin_src emacs-lisp
(straight-use-package 'auctex)
 #+end_src
**** CDLaTex
  #+begin_src emacs-lisp
  (use-package cdlatex
    :hook 
    (org-mode . org-cdlatex-mode)
    (LaTeX-mode . cdlatex-mode)
    (latex-mode . cdlatex-mode)
    )
  #+end_src
*** Swift
#+begin_src emacs-lisp
(use-package swift-mode
  :mode "\\.swift\\'"
  :hook (swift-mode . (lambda () (lsp-deferred))))

(use-package lsp-sourcekit
  :after swift-mode
  :config
  (setq lsp-sourcekit-executable "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/sourcekit-lsp"))
#+end_src
*** Yaml
#+begin_src emacs-lisp
(use-package yaml-mode
  :mode "\\.yaml\\'")
#+end_src
*** R
#+begin_src emacs-lisp
(use-package ess
  :disabled)
#+end_src
*** Json
#+begin_src emacs-lisp
(use-package json-mode
  :mode "\\.json\\'"
	:config
	(add-hook 'json-mode-hook #'dw/set-js-indentation))
#+end_src
** Dap Debug Mode
#+begin_src emacs-lisp
;; dap debug tools
(use-package dap-mode
  :commands dap-debug
  :custom
  (dap-auto-configure-features '(sessions locals controls tooltip))
  :config
	;; Set up python debugging
	(require 'dap-python)
	
	;; Set up chrome debugging
	(require 'dap-chrome)
	(dap-chrome-setup)
)

;; Don't use built-in syntax checking
(setq js2-mode-show-strict-warnings nil)

;; Set up proper indentation in JavaScript and JSON files
(add-hook 'js2-mode-hook #'dw/set-js-indentation)
(add-hook 'json-mode-hook #'dw/set-js-indentation)

(use-package prettier-js
	:disabled
  :hook ((js2-mode . prettier-js-mode)
         (typescript-mode . prettier-js-mode))
  :config
  (setq prettier-js-show-errors nil))
#+end_src
*** CoffeeScript
#+begin_src emacs-lisp
(use-package coffee-mode
  :mode "\\.coffee\\'"
  :config
  ;; automatically clean up bad whitespace
  (setq whitespace-action '(auto-cleanup))
  ;; This gives you a tab of 2 spaces
  (custom-set-variables '(coffee-tab-width 2))
  
  (use-package sourcemap)
  ;; generating sourcemap by '-m' option. And you must set '--no-header' option
  (setq coffee-args-compile '("-c" "--no-header" "-m"))
  (add-hook 'coffee-after-compile-hook 'sourcemap-goto-corresponding-point)

  ;; If you want to remove sourcemap file after jumping corresponding point
  (defun my/coffee-after-compile-hook (props)
    (sourcemap-goto-corresponding-point props)
    (delete-file (plist-get props :sourcemap)))
  (add-hook 'coffee-after-compile-hook 'my/coffee-after-compile-hook)
  )

(use-package flymake-coffee
  :hook (coffee-mode . flymake-coffee)
  )
#+end_src
*** Web (HTML/CSS)
**** HTML
  #+begin_src emacs-lisp
  (use-package web-mode
    :mode "\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'")

  ;; Preview the html file
  (use-package skewer-mode
    :after web-mode
    :config
    (add-hook 'js2-mode-hook 'skewer-mode)
    (add-hook 'css-mode-hook 'skewer-css-mode)
    (add-hook 'html-mode-hook 'skewer-html-mode)
    (add-hook 'web-mode-hook 'skewer-html-mode))
  #+end_src
**** Emmet
  #+begin_src emacs-lisp
    (use-package emmet-mode
      :hook (web-mode . emmet-mode))
  #+end_src
**** SCSS/SASS
#+begin_src emacs-lisp
(use-package scss-mode
  :mode "\\.scss\\'"
  :custom
  (scss-compile-at-save t)
  (scss-output-directory "../css")
  (scss-sass-command "sass --no-source-map")
  )

#+end_src
*** Java
#+begin_src emacs-lisp
(use-package lsp-java
  :hook (java-mode . lsp-deferred)
  )
#+end_src
*** Latex
**** latex-preview-pane
  Preview latex files as PDF in Emacs
  #+begin_src emacs-lisp
  (use-package latex-preview-pane
    :after (tex-mode Latex-mode latex-mode TeX-latex-mode))
  #+end_src
**** AucTex
#+begin_src emacs-lisp
(straight-use-package 'auctex)
 #+end_src
**** CDLaTex
  #+begin_src emacs-lisp
  (use-package cdlatex
    :hook 
    (org-mode . org-cdlatex-mode)
    (LaTeX-mode . cdlatex-mode)
    (latex-mode . cdlatex-mode)
    )
  #+end_src
*** Swift
#+begin_src emacs-lisp
(use-package lsp-sourcekit
  :after swift-mode
  :config
  (setq lsp-sourcekit-executable "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/sourcekit-lsp"))

(use-package swift-mode
  :mode "\\.swift\\'"
  :hook (swift-mode . (lambda () (lsp-deferred))))
#+end_src
*** Yaml
#+begin_src emacs-lisp
(use-package yaml-mode
  :mode "\\.yaml\\'")
#+end_src
*** R
#+begin_src emacs-lisp
(use-package ess
  :disabled)
#+end_src
*** Json
#+begin_src emacs-lisp
(use-package json-mode
  :mode "\\.json\\'")
#+end_src
** Dap Debug Mode
#+begin_src emacs-lisp
;; dap debug tools
(use-package dap-mode
  :commands dap-debug
  :custom
  (dap-auto-configure-features '(sessions locals controls tooltip))
  :config
  ;; Set up python debugging
  (require 'dap-python)

  ;; Set up chrome debugging
  (require 'dap-chrome)
  (dap-chrome-setup)

  ;; Set up node debugging
  (require 'dap-node)
  (dap-node-setup)

  (require 'dap-java)
  )
#+end_src
** Term/Shells
*** Vterm
Vitual Termianl
#+begin_src shell
brew install libtool libvterm 
#+end_src
#+begin_src emacs-lisp
(use-package vterm
  :commands vterm
  :config
  (setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
  (setq vterm-max-scrollback 10000))

(use-package multi-vterm
  :commands multi-vterm)

(use-package vterm-toggle
  :commands vterm-toggle)
#+end_src
** Tmux
*** Emamux
#+begin_src emacs-lisp
(if (not (display-graphic-p))
	 (use-package emamux
	   :bind ("C-z" . emamux:keymap)
	   ;; :config
	   ;; (global-set-key (kbd "C-z") emamux:keymap)
	   )
  )
#+end_src
*** Tmux-pane
#+begin_src emacs-lisp
(if (not (display-graphic-p))
    (use-package tmux-pane
      :disabled
      :config
      (tmux-pane-mode)
      )
  )


#+end_src
** Git
*** Magit
#+begin_src emacs-lisp
(use-package magit
  :commands (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; Add a super-convenient global binding for magit-status since
;; I use it 8 million times a day
(global-set-key (kbd "C-M-;") 'magit-status)
#+end_src
** LeetCode Client
#+begin_src emacs-lisp
(use-package leetcode
  :commands (leetcode start-leetcode)
  :custom
  (leetcode-prefer-language "python3")
  (leetcode-prefer-sql "mysql")
  (leetcode-save-solutions t)
  (leetcode-directory "~/Documents/leetcode")
  )

(defun start-leetcode()
    (interactive)
    (global-display-line-numbers-mode -1)
    (display-line-numbers-mode -1)
    (leetcode)
    )

(defun quit-leetcode()
  (interactive)
  (leetcode-quit)
  (global-line-numebrs-mode t)
  )
#+end_src
* Utilities
** Clipboard managers
#+begin_src emacs-lisp
(use-package cliphist
	:commands (cliphist-paste-item cliphist-select-item)
	)
#+end_src
* Increase memory/garbage 
Make Emacs/lsp more smooth
#+begin_src emacs-lisp
(setq gc-cons-threshold 100000000)
#+end_src

* Increase the amount of data which Emacs reads from the process
Same as above
#+begin_src emacs-lisp
(setq read-process-output-max (* 1024 1024)) ;; 1mb
#+end_src
* Load Plugings Based On Graphic Setting
#+begin_src emacs-lisp
(if (or (display-graphic-p) (and (daemonp) (not (string= (daemonp) "tty"))))
    (dolist (elisp-code graphic-only-plugins-setting)
      (eval elisp-code)))
#+end_src

